// abstract-забороняє створення об'єкта певного типу
abstract class Animal{
    isALive:boolean;

    constructor(isALive: boolean) {
        this.isALive = isALive;
    }
    //відповідно появляється можливість формувати абстрактні методи і це означає що цей метод не має тіла своєї реалізації,
    // звісно можна поставити той тип даних який потрібно abstract bark(arg:string):string;
    abstract bark():void;//буду консоль лог використовувати
}
 // let animal = new Animal(true);
//тепер цей клас можу використовувати як основу чогось

class Birn extends Animal{// тобто буде підписаний свій контракт тобто Birn буде реалізувати все те що не реалізовано в нашому Animal тобто в нього буде isALive і метод bark()
  wings:boolean;

    constructor(isALive: boolean, wings: boolean) {
        super(isALive);
        this.wings = wings;
    }
//коли тут помилка на Birn то натискаємо General =>members to implement-то потрібно реалізувати bark() і вказати як саме він буде працювати
    bark(): void {
        console.log('chik chirik');
    }
}
// то це означає що  Birn імплементує Animal
// тобто abstract class Animal беру за основу для чогось того що окремо сепаровано не захочете ніколи створювати або беремо як своє рідну схему по якій маубутні класи повинні працювати або те що в якому напрямку вони повинні працювати а не те як саме
// повинні працювати тобто вказувати. Є різниця то
// множиний експенд забороняється
// ланцюг залежності від класу він не обмеженний і можна сказати що схоже на інтерфкйси
