"use strict";
// abstract-забороняє створення об'єкта певного типу
class Animal {
    constructor(isALive) {
        this.isALive = isALive;
    }
}
// let animal = new Animal(true);
//тепер цей клас можу використовувати як основу чогось
class Birn extends Animal {
    constructor(isALive, wings) {
        super(isALive);
        this.wings = wings;
    }
    //коли тут помилка на Birn то натискаємо General =>members to implement-то потрібно реалізувати bark() і вказати як саме він буде працювати
    bark() {
        console.log('chik chirik');
    }
}
// то це означає що  Birn імплементує Animal
// тобто abstract class Animal беру за основу для чогось того що окремо сепаровано не захочете ніколи створювати або беремо як своє рідну схему по якій маубутні класи повинні працювати або те що в якому напрямку вони повинні працювати а не те як саме
// повинні працювати тобто вказувати. Є різниця то
// множиний експенд забороняється
// ланцюг залежності від класу він не обмеженний і можна сказати що схоже на інтерфкйси
