// //дані беремо із бази даних вона не найкращому станові вона денормалізована і хтось колись дав можливість записувати дані в цю базу використовуючи id як число так і стрінгу, потім знайщли ще один об'єкт який може бути булевим і ще якимось іншим типом.
// // питання яким чином ми можемо типізувати?
//
// class UserGen <T1>{
//     // Id : number |{type:string, value:number} | string;// так кожний раз неможемо писати але щоб такого не було типизуємо його <T> T- це просто назва для нашого типу, можемо будьщо писати що воно характеризує,тобто зараз появилась можливість записати конкретні типи в класах
//
//     id:T1;
//     name:string;
//
//     constructor(id: T1, name: string) {// T1 = тобто це заглушка якась для майбутнього типу
//         this.id = id;
//         this.name = name;
//     }
// }
// // перед тим як викликати то провині написати яким типом буде індитифікатор і вказується це в місті де дженерик<>
// // клас це шаблон не забуваємо
//
// let userGen = new UserGen<number>(1, 'masha');
// let userGen1 = new UserGen<string>('1', 'dasha');// це дає можливість розширння така варіативність типів а з іншої сторони це обмеження для нашої майбутньої роботи або не можливісті зробити зайві помилки
// let userGen = new UserGen<{x:number}>({x: 1000}, 'masha');
// console.log(userGen);
//
// let arr:number[] = [11,22,33];
// let arr1:Array<number> = [11,22,33];//тобто існує клас який називається Array
//
// // Женерики <> можуть застосовуватися не тільки з класами їх полями та аргументами а із функціями або методами
// // портрібно дізнатися різницю між методами і функції(ф-я= це окремий об'єкт, метод= це ф-я оголошена межах класу,відповідно це не об'єкт і вона не може існувати окремо,для тогощоб вона була ініцілізованга для того щоб можна було її використовувати потрібно стоворити об'єкт який її тримає)

//пишем ф-ю яка використовує Дженерік <> буде такий варіант який буде на реакті
// отримаємо об'єкт через локалсторіч

let item = localStorage.getItem('x');// може повернути item=> нал або стрінгу якщо не існує..то 33 рядку

if (item){

// прганяємо через джейсон і отримуємо об'єкт який відразу отримуємо
    let obj = JSON.parse(item);// ми питаємося передати null і воно може не працювати то ми робимо перевірку
}



//якщо працюємо із юзером і хочемо витягнути щось із нього то бо не знаємо що затип даних тут знаходиться то потрібно скачтувати або привести жорстко привести до певного типу
interface IUserLS{
    id: number;
    name: string;
}

let item12 = localStorage.getItem('user');

if (item12){
    let obj = JSON.parse(item12);
    let user:IUserLS = obj as IUserLS;// тобто це комірка де знаходиться об'єкт такого типу
}

interface IDog {
    aka:string;
}
// то це все однакове то робимо функцію
function foobar<T>(key:string):T {
    let objJSON= localStorage.getItem('key');
    if (objJSON){
        return  JSON.parse(objJSON) as T;
    }
   return {} as T;
}

let iDog = foobar<IDog>('dog');// Тобто працюю з <IDog>а шукаю ('dog')
let iUserLs = foobar<IUserLS>('user');
